Autodesk.Revit.DB.Electrical.WiringType
An enumerated type to list all wiring types.

Autodesk.Revit.DB.Electrical.WiringType.Chamfer
Chamfered wiring can be used to indicate wiring that is exposed.

Autodesk.Revit.DB.Electrical.WiringType.Arc
Arc wiring is used to indicate wiring that is concealed within walls, ceilings, or floors.